brew "zsh"
brew "bat" # better cat
brew "cloc" # code line counter
brew "jq"
brew "tmux" # terminal multiplexer
brew "tldr" # better manpages
brew "vim"
brew "neovim"
brew "tree"
brew "htop" # top replacement
brew "rsync"
brew "keychain" # SSH keychain

brew "git"
brew "git-gui"
brew "git-lfs"

cask "meld" # diff tool
cask "insomnia"
cask "intellij-idea"
cask "goland"
#cask "iterm2"
cask "postman"
#cask "slack"
cask "visual-studio-code"
cask "flameshot"
cask "wireshark" # network analyzer
cask "zoom"
cask "bitwarden"
cask "docker"
cask "rectangle"

cask "spotify"

tap "homebrew/cask-fonts"
cask "font-dejavu"
cask "font-dejavu-sans-mono-nerd-font"

brew "go"
brew "gradle"
brew "yarn"
brew "nvm"
brew "openssl"
brew "postgresql@12"
